package com.van.demo.utils;


import com.van.demo.bean.User;

import java.time.LocalDateTime;
import java.time.ZoneOffset;
import java.time.format.DateTimeFormatter;
import java.util.ArrayList;
import java.util.List;

/**
 * @author: VaN
 * @since: 2020/10/19 16:20
 * @remark:
 */
public class UserGenerator {


    /**
     * 时间格式
     */
    private static DateTimeFormatter formatter = DateTimeFormatter.ofPattern("yyyy-MM-dd HH:mm:ss");

    private static int getNum(int start, int end) {
        return (int) (Math.random() * (end - start + 1) + start);
    }


    private static String base = "abcdefghijklmnopqrstuvwxyz0123456789";
    private static final String[] email_suffix = "@gmail.com,@yahoo.com,@msn.com,@hotmail.com,@aol.com,@ask.com,@asiainfo.com,@live.com,@qq.com,@0355.net,@163.com,@163.net,@263.net,@3721.net,@yeah.net,@googlemail.com,@126.com,@sina.com,@sohu.com,@yahoo.com.cn".split(",");

    /**
     * 随机姓
     */
    private final static String[] SURNAME = {"赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈", "褚", "卫", "蒋", "沈", "韩", "杨", "朱", "秦", "尤", "许",
            "何", "吕", "施", "张", "孔", "曹", "严", "华", "金", "魏", "陶", "姜", "戚", "谢", "邹", "喻", "柏", "水", "窦", "章", "云", "苏", "潘", "葛", "奚", "范", "彭", "郎",
            "鲁", "韦", "昌", "马", "苗", "凤", "花", "方", "俞", "任", "袁", "柳", "酆", "鲍", "史", "唐", "费", "廉", "岑", "薛", "雷", "贺", "倪", "汤", "滕", "殷",
            "罗", "毕", "郝", "邬", "安", "常", "乐", "于", "时", "傅", "皮", "卞", "齐", "康", "伍", "余", "元", "卜", "顾", "孟", "平", "黄", "和",
            "穆", "萧", "尹", "姚", "邵", "湛", "汪", "祁", "毛", "禹", "狄", "米", "贝", "明", "臧", "计", "伏", "成", "戴", "谈", "宋", "茅", "庞", "熊", "纪", "舒",
            "屈", "项", "祝", "董", "梁", "杜", "阮", "蓝", "闵", "席", "季", "麻", "强", "贾", "路", "娄", "危", "江", "童", "颜", "郭", "梅", "盛", "林", "刁", "钟",
            "徐", "邱", "骆", "高", "夏", "蔡", "田", "樊", "胡", "凌", "霍", "虞", "万", "支", "柯", "昝", "管", "卢", "莫", "经", "房", "裘", "缪", "干", "解", "应",
            "宗", "丁", "宣", "贲", "邓", "郁", "单", "杭", "洪", "包", "诸", "左", "石", "崔", "吉", "钮", "龚", "程", "嵇", "邢", "滑", "裴", "陆", "荣", "翁", "荀",
            "羊", "于", "惠", "甄", "曲", "家", "封", "芮", "羿", "储", "靳", "汲", "邴", "糜", "松", "井", "段", "富", "巫", "乌", "焦", "巴", "弓", "牧", "隗", "山",
            "谷", "车", "侯", "宓", "蓬", "全", "郗", "班", "仰", "秋", "仲", "伊", "宫", "宁", "仇", "栾", "暴", "甘", "钭", "厉", "戎", "祖", "武", "符", "刘", "景",
            "詹", "束", "龙", "叶", "幸", "司", "韶", "郜", "黎", "蓟", "溥", "印", "宿", "白", "怀", "蒲", "邰", "从", "鄂", "索", "咸", "籍", "赖", "卓", "蔺", "屠",
            "蒙", "池", "乔", "阴", "郁", "胥", "能", "苍", "双", "闻", "莘", "党", "翟", "谭", "贡", "劳", "逄", "姬", "申", "扶", "堵", "冉", "宰", "郦", "雍", "却",
            "璩", "桑", "桂", "濮", "牛", "寿", "通", "边", "扈", "燕", "冀", "浦", "尚", "农", "温", "别", "庄", "晏", "柴", "瞿", "阎", "充", "慕", "连", "茹", "习",
            "宦", "艾", "鱼", "容", "向", "古", "易", "慎", "戈", "廖", "庾", "终", "暨", "居", "衡", "步", "都", "耿", "满", "弘", "匡", "国", "文", "寇", "广", "禄",
            "阙", "东", "欧", "殳", "沃", "利", "蔚", "越", "夔", "隆", "师", "巩", "厍", "聂", "晁", "勾", "敖", "融", "冷", "訾", "辛", "阚", "那", "简", "饶", "空",
            "曾", "毋", "沙", "乜", "养", "鞠", "须", "丰", "巢", "关", "蒯", "相", "查", "后", "荆", "红", "游", "郏", "竺", "权", "逯", "盖", "益", "桓", "公", "仉",
            "督", "岳", "帅", "缑", "亢", "况", "郈", "有", "琴", "归", "海", "晋", "楚", "闫", "法", "汝", "鄢", "涂", "钦", "商", "牟", "佘", "佴", "伯", "赏", "墨",
            "哈", "谯", "篁", "年", "爱", "阳", "佟", "言", "福", "南", "火", "铁", "迟", "漆", "官", "冼", "真", "展", "繁", "檀", "祭", "密", "敬", "揭", "舜", "楼",
            "疏", "冒", "浑", "挚", "胶", "随", "高", "皋", "原", "种", "练", "弥", "仓", "眭", "蹇", "覃", "阿", "门", "恽", "来", "綦", "召", "仪", "风", "介", "巨",
            "木", "京", "狐", "郇", "虎", "枚", "抗", "达", "杞", "苌", "折", "麦", "庆", "过", "竹", "端", "鲜", "皇", "亓", "老", "是", "秘", "畅", "邝", "还", "宾",
            "闾", "辜", "纵", "侴", "万俟", "司马", "上官", "欧阳", "夏侯", "诸葛", "闻人", "东方", "赫连", "皇甫", "羊舌", "尉迟", "公羊", "澹台", "公冶", "宗正",
            "濮阳", "淳于", "单于", "太叔", "申屠", "公孙", "仲孙", "轩辕", "令狐", "钟离", "宇文", "长孙", "慕容", "鲜于", "闾丘", "司徒", "司空", "兀官", "司寇",
            "南门", "呼延", "子车", "颛孙", "端木", "巫马", "公西", "漆雕", "车正", "壤驷", "公良", "拓跋", "夹谷", "宰父", "谷梁", "段干", "百里", "东郭", "微生",
            "梁丘", "左丘", "东门", "西门", "南宫", "第五", "公仪", "公乘", "太史", "仲长", "叔孙", "屈突", "尔朱", "东乡", "相里", "胡母", "司城", "张廖", "雍门",
            "毋丘", "贺兰", "綦毋", "屋庐", "独孤", "南郭", "北宫", "王孙"};


    /**
     * 随机名
     */
    private final static String[] SURADDRESS = {"合肥", "安庆", "安庆", "蚌埠", "蚌埠", "亳州", "亳州", "巢湖", "巢湖", "滁州", "滁州", "阜阳", "阜阳",
            "贵池", "贵池",
            "淮北", "淮北", "淮化", "淮化", "淮南", "淮南", "黄山", "黄山", "九华山", "九华山", "六安", "六安", "马鞍山", "马鞍山", "宿州", "宿州",
            "铜陵",
            "铜陵", "屯溪", "屯溪", "芜湖", "芜湖", "宣城", "宣城", "东城", "东城", "西城", "西城", "崇文", "崇文", "宣武", "宣武", "朝阳", "朝阳", "丰台",
            "丰台", "石景山", "石景山", "海淀", "海淀", "门头沟", "门头沟", "房山", "房山", "通州", "通州", "顺义", "顺义", "昌平", "昌平", "大兴", "大兴", "平谷",
            "平谷", "怀柔", "怀柔", "密云", "密云", "延庆", "延庆", "万州", "万州", "涪陵", "涪陵", "渝中", "渝中", "大渡口", "大渡口", "江北", "江北", "沙坪坝",
            "沙坪坝", "九龙坡", "九龙坡", "南岸", "南岸", "北碚", "北碚", "万盛", "万盛", "双挢", "双挢", "渝北", "渝北", "巴南", "巴南", "黔江", "黔江", "长寿",
            "长寿", "綦江", "綦江", "潼南", "潼南", "铜梁", "铜梁", "大足", "大足", "荣昌", "荣昌", "壁山", "壁山", "梁平", "梁平", "城口", "城口", "丰都", "丰都",
            "垫江", "垫江", "武隆", "武隆", "忠县", "忠县", "开县", "开县", "云阳", "云阳", "奉节", "奉节", "巫山", "巫山", "巫溪", "巫溪", "石柱", "石柱",
            "高芬", "高峯", "高峰", "高歌", "高格", "高寒", "高翰", "高杰", "高洁", "高峻", "高朗", "高丽", "高邈", "高旻", "高明", "高爽", "高兴", "高轩",
            "高雅", "高扬", "高阳",
            "高义", "高谊", "高逸", "高懿", "高原", "高远", "高韵", "高卓", "光赫", "光华", "光辉", "光济", "光霁", "光亮", "光临", "光明", "光启", "光熙",
            "光耀", "光誉", "光远",
            "国安", "国兴", "国源", "冠宇", "冠玉", "晗昱", "晗日", "涵畅", "涵涤", "涵亮", "涵忍", "涵容", "涵润", "涵涵", "涵煦", "涵蓄", "涵衍",
            "涵意", "涵映", "涵育", "翰采",
            "翰池", "翰飞", "翰海", "翰翮", "翰林", "翰墨", "翰学", "翰音", "瀚玥", "翰藻", "瀚海", "瀚漠", "昊苍", "昊昊", "昊空", "昊乾", "昊穹", "昊然",
            "昊然", "昊天", "昊焱", "昊英",
            "浩波", "浩博", "浩初", "浩大", "浩宕", "浩荡", "浩歌", "浩广", "浩涆", "浩瀚", "浩浩", "浩慨", "浩旷", "浩阔", "浩漫", "浩淼", "浩渺", "浩邈",
            "浩气", "浩然", "浩穰", "浩壤", "浩思",
            "浩言", "皓轩", "和蔼", "和安", "和璧", "和昶", "和畅", "和风", "和歌", "和光", "和平", "和洽", "和惬", "和顺", "和硕", "和颂", "和泰", "和悌",
            "和通", "和同", "和煦", "和雅",
            "和宜", "和怡", "和玉", "和裕", "和豫", "和悦", "和韵", "和泽", "和正", "和志", "鹤轩", "弘博", "弘大", "弘方", "弘光", "弘和", "弘厚", "弘化",
            "弘济", "弘阔", "弘亮", "弘量", "弘深", "弘盛", "弘图", "弘伟", "弘文",
            "弘新", "弘雅", "弘扬", "弘业", "弘义", "弘益", "弘毅", "弘懿", "弘致", "弘壮", "宏伯", "宏博", "宏才", "宏畅", "宏达", "宏大", "宏放", "宏富",
            "宏峻", "宏浚", "宏恺", "宏旷", "宏阔", "宏朗", "宏茂", "宏邈", "宏儒",
            "宏深", "宏胜", "宏盛", "宏爽", "宏硕", "宏伟", "宏扬", "宏义", "宏逸", "宏毅", "宏远", "宏壮", "鸿宝", "鸿波", "鸿博", "鸿才", "鸿彩", "鸿畅",
            "鸿畴", "鸿达", "鸿德", "鸿飞", "鸿风", "鸿福", "鸿光", "鸿晖", "鸿朗",
            "鸿文", "鸿熙", "鸿羲", "鸿禧", "鸿信", "鸿轩", "鸿煊", "鸿煊", "鸿雪", "鸿羽", "鸿远", "鸿云", "鸿运", "鸿哲", "鸿祯", "鸿振", "鸿志", "鸿卓",
            "华奥", "华采", "华彩", "华灿", "华藏", "华池", "华翰", "华皓", "华晖",
            "华辉", "华茂", "华美", "华清", "华荣", "华容", "J", "嘉赐", "嘉德", "嘉福", "嘉良", "嘉茂", "嘉木", "嘉慕", "嘉纳", "嘉年", "嘉平", "嘉庆", "嘉荣", "嘉容", "嘉瑞", "嘉胜", "嘉石", "嘉实", "嘉树", "嘉澍", "嘉熙", "嘉禧",
            "嘉祥", "嘉歆", "嘉许", "嘉勋", "嘉言", "嘉谊", "嘉懿", "嘉颖", "嘉佑", "嘉玉", "嘉誉", "嘉悦", "嘉运", "嘉泽", "嘉珍", "嘉祯", "嘉志",
            "嘉致", "坚白", "坚壁", "坚秉", "坚成", "坚诚", "建安", "建白", "建柏", "建本", "建弼", "建德", "建华", "建明", "建茗", "建木", "建树",
            "建同", "建修", "建业", "建义", "建元", "建章", "建中", "健柏", "金鑫", "锦程", "瑾瑜", "晋鹏", "经赋", "经亘", "经国",
            "经略", "经纶", "经纬", "经武", "经业", "经义", "经艺", "景澄", "景福", "景焕", "景辉", "景辉", "景龙", "景明", "景山", "景胜", "景铄",
            "景天", "景同", "景曜", "靖琪", "君昊", "君浩", "俊艾", "俊拔", "俊弼", "俊才", "俊材", "俊驰", "俊楚", "俊达", "俊德", "俊发", "俊风",
            "俊豪", "俊健", "俊杰", "俊捷", "俊郎", "俊力", "俊良", "俊迈", "俊茂", "俊美", "俊民", "俊名", "俊明", "俊楠", "俊能", "俊人", "俊爽",
            "俊悟", "俊晤", "俊侠", "俊贤", "俊雄", "俊雅", "俊彦", "俊逸", "俊英", "俊友", "俊语", "俊誉", "俊远", "俊哲", "俊喆", "俊智", "峻熙",
            "季萌", "季同", "开畅", "开诚", "开宇", "开济", "开霁", "开朗", "凯安", "凯唱", "凯定", "凯风", "凯复", "凯歌", "凯捷", "凯凯",
            "凯康", "凯乐", "凯旋", "凯泽", "恺歌", "恺乐", "康安", "康伯", "康成", "康德", "康复", "康健", "康乐", "康宁", "康平", "康胜", "康盛", "康时",
            "康适", "康顺", "康泰",
            "康裕", "乐安", "乐邦", "乐成", "乐池", "乐和", "乐家", "乐康", "乐人", "乐容", "乐山", "乐生", "乐圣", "乐水", "乐天", "乐童", "乐贤",
            "乐心", "乐欣", "乐逸", "乐意", "乐音", "乐咏", "乐游", "乐语", "乐悦", "乐湛", "乐章", "乐正", "乐志", "黎昕", "黎明", "力夫", "力强",
            "力勤", "力行", "力学", "力言", "立诚", "立果", "立人", "立辉", "立轩", "立群", "良奥", "良弼", "良才", "良材", "良策", "良畴", "良工",
            "良翰", "良吉", "良骥", "良俊", "良骏", "良朋", "良平", "良哲", "理群", "理全", "M", "茂才", "茂材", "茂德", "茂典", "茂实", "茂学",
            "茂勋", "茂彦", "敏博", "敏才", "敏达", "敏叡", "敏学", "敏智", "明诚", "明达", "明德", "明辉", "明杰", "明俊", "明朗", "明亮", "明旭",
            "明煦", "明轩", "明远", "明哲", "明喆", "明知", "明志", "明智", "明珠", "朋兴", "朋义", "彭勃", "彭薄", "彭湃", "彭彭", "彭魄", "彭越",
            "彭泽", "彭祖", "鹏程", "鹏池", "鹏飞", "鹏赋", "鹏海", "鹏鲸", "鹏举", "鹏鹍", "鹏鲲", "鹏涛", "鹏天", "鹏翼", "鹏云", "鹏运", "濮存",
            "溥心", "璞玉", "璞瑜", "浦和", "浦泽", "奇略", "奇迈", "奇胜", "奇水", "奇思", "奇邃", "奇伟", "奇玮", "奇文", "奇希", "奇逸",
            "奇正", "奇志", "奇致", "祺福", "祺然", "祺祥", "祺瑞", "琪睿", "庆生", "R", "荣轩", "锐达", "锐锋", "锐翰", "锐进", "锐精", "锐立", "锐利",
            "锐思", "锐逸", "锐意", "锐藻", "锐泽", "锐阵", "锐志", "锐智", "睿博", "睿才", "睿诚", "睿慈", "睿聪", "睿达", "睿德", "睿范", "睿广", "睿好",
            "睿明", "睿识", "睿思", "绍辉", "绍钧", "绍祺", "绍元", "升荣", "圣杰", "晟睿", "思聪", "思淼", "思源", "思远", "思博", "斯年", "斯伯",
            "泰初", "泰和", "泰河", "泰鸿", "泰华", "泰宁", "泰平", "泰清", "泰然", "天材", "天成", "天赋", "天干", "天罡", "天工", "天翰", "天和", "天华",
            "天骄", "天空", "天禄", "天路", "天瑞", "天睿", "天逸", "天佑", "天宇", "天元", "天韵", "天泽", "天纵", "同方", "同甫", "同光", "同和", "同化",
            "同济",
            "巍昂", "巍然", "巍奕", "伟博", "伟毅", "伟才", "伟诚", "伟茂", "伟懋", "伟祺", "伟彦", "伟晔", "伟泽", "伟兆", "伟志", "温纶", "温茂", "温书",
            "温韦", "温文", "温瑜", "文柏", "文昌", "文成", "文德", "文栋", "文赋", "文光", "文翰", "文虹", "文华", "文康", "文乐", "文林", "文敏", "文瑞",
            "文山", "文石", "文星", "文轩", "文宣", "文彦", "文曜", "文耀", "文斌", "文彬", "文滨", "X", "向晨", "向笛", "向文", "向明", "向荣", "向阳",
            "翔宇", "翔飞",
            "项禹", "项明", "晓博", "心水", "心思", "心远", "欣德", "欣嘉", "欣可", "欣然", "欣荣", "欣怡", "欣怿", "欣悦", "新翰", "新霁", "新觉", "新立",
            "新荣", "新知", "信鸿", "信厚", "信鸥", "信然", "信瑞", "兴安", "兴邦", "兴昌", "兴朝", "兴德", "兴发", "兴国", "兴怀", "兴平", "兴庆", "兴生",
            "兴思", "兴腾", "兴旺", "兴为", "兴文", "兴贤", "兴修", "兴学", "兴言", "兴业", "兴运", "星波", "星辰", "星驰", "星光", "星海", "星汉", "星河",
            "星华", "星晖", "星火",
            "星剑", "星津", "星阑", "星纬", "星文", "星宇", "星雨", "星渊", "星洲", "修诚", "修德", "修杰", "修洁", "修谨", "修筠", "修明", "修能", "修平",
            "修齐", "修然", "修为", "修伟", "修文", "修雅", "修永", "修远", "修真", "修竹", "修贤", "旭尧", "炫明", "学博", "学海",
            "学林", "学民", "学名", "学文", "学义", "学真", "雪松", "雪峰", "雪风", "Y", "雅昶", "雅畅", "雅达", "雅惠", "雅健", "雅珺", "雅逸", "雅懿", "雅志", "炎彬", "阳飙", "阳飇", "阳冰", "阳波", "阳伯", "阳成", "阳德", "阳华", "阳晖", "阳辉", "阳嘉", "阳平", "阳秋", "阳荣", "阳舒", "阳朔", "阳文", "阳曦", "阳夏", "阳旭", "阳煦", "阳炎", "阳焱", "阳曜", "阳羽", "阳云", "阳泽", "阳州", "烨赫", "烨华", "烨磊", "烨霖", "烨然", "烨烁", "烨伟", "烨烨", "烨熠",
            "烨煜", "毅然", "逸仙", "逸明", "逸春", "宜春", "宜民", "宜年", "宜然", "宜人", "宜修", "意远", "意蕴", "意致", "意智", "熠彤", "懿轩", "英飙",
            "英博", "英才", "英达", "英发",
            "英范", "英光", "英豪", "英华", "英杰", "英朗", "英锐", "英睿", "英叡", "英韶", "英卫", "英武", "英悟", "英勋", "英彦", "英耀", "英奕", "英逸",
            "英毅", "英哲", "英喆", "英卓", "英资", "英纵", "永怡", "永春", "永安", "永昌", "永长", "永丰", "永福", "永嘉", "永康", "永年", "永宁", "永寿",
            "永思", "永望", "永新", "永言", "永逸", "永元", "永贞", "咏德", "咏歌", "咏思", "咏志", "勇男", "勇军", "勇捷", "勇锐", "勇毅", "宇达", "宇航",
            "宇寰", "宇文", "宇荫", "雨伯", "雨华", "雨石", "雨信", "雨星", "雨泽", "玉宸", "玉成", "玉龙", "玉泉", "玉山", "玉石", "玉书", "玉树", "玉堂",
            "玉轩", "玉宇", "玉韵", "玉泽", "煜祺", "元白",
            "元德", "元化", "元基", "元嘉", "元甲", "元驹", "元凯", "元恺", "元魁", "元良", "元亮", "元龙", "元明", "元青", "元思", "元纬", "元武", "元勋",
            "元正", "元忠", "元洲", "远航", "苑博", "苑杰", "越彬", "蕴涵", "蕴和", "蕴藉", "Z", "展鹏", "哲瀚", "哲茂", "哲圣", "哲彦", "振海", "振国",
            "正诚", "正初", "正德", "正浩", "正豪", "正平", "正奇", "正青", "正卿", "正文", "正祥", "正信", "正雅", "正阳", "正业", "正谊", "正真", "正志",
            "志诚", "志新", "志勇", "志明", "志国", "志强", "志尚", "志专", "志文", "志行", "志学", "志业", "志义", "志用", "志泽",
            "致远", "智明", "智鑫", "智勇", "智敏", "智志", "智渊", "子安", "子晋", "子民", "子明", "子默", "子墨", "子平", "子琪", "子石", "子实", "子真",
            "子濯", "子昂", "子轩", "子瑜",
            "自明", "自强", "作人", "自怡", "自珍", "曾琪", "泽宇", "泽语", "荌荌", "安卉", "安娜", "安妮", "安然", "傲冬", "傲晴", "傲雪", "白雪", "白云",
            "碧螺", "碧菡", "碧玉", "冰蓝", "冰冰", "采绿", "采文", "采萱", "初雪", "春华", "春雪", "丹丹", "丹彤", "丹红", "冬雪", "芳芳", "方方", "芳菲",
            "芳华", "芳馨", "芳泽", "芳馥", "芳懿", "芳茵", "芳蕙", "芳春", "芳洲", "芳蕤", "芳润", "芳荃", "芳林", "芳苓", "芳洁", "芳蔼", "飞双", "飞雪",
            "飞烟", "飞燕", "飞英", "谷雪", "古兰", "古韵", "古香", "歌阑", "歌吹", "歌韵", "歌飞",
            "格菲", "葛菲", "戈雅", "格格", "含烟", "含玉", "涵菡", "晗蕾", "涵韵", "晗玥", "寒凝", "寒香", "寒雁", "和悌", "和美", "和怡", "和雅", "和璧",
            "和玉", "和暖", "红叶", "红豆", "红雪", "红英", "红云", "红旭", "红香", "红艳", "红螺", "虹雨", "虹彩",
            "虹英", "虹颖", "虹影", "怀玉", "慧心", "慧颖", "慧雅", "慧智", "慧美", "慧捷", "慧丽", "慧月", "慧云", "慧俊", "慧秀", "慧巧", "慧英", "家美",
            "家欣", "家馨", "佳悦", "嘉怡", "嘉宝", "嘉惠", "嘉悦", "嘉歆", "嘉美", "嘉云",
            "嘉玉", "嘉丽", "嘉淑", "嘉怡", "嘉懿", "洁玉", "晶滢", "晶辉", "静曼", "静涵", "静逸", "静姝", "静娴", "静婉", "静雅", "静慧", "静云", "静安",
            "静秀", "娟秀", "娟妍", "娟丽", "娟巧", "兰若", "兰蕙", "兰梦", "兰泽", "兰芝", "兰英", "兰娜", "岚霏", "岚翠", "岚彩", "乐安", "乐心", "乐悦",
            "乐容", "乐英", "丽泽", "丽华", "丽雅", "丽芳", "丽佳", "丽姿", "丽珠", "丽容", "丽文", "灵秀", "灵韵", "灵慧", "灵卉", "灵萱", "玲玲", "玲珑",
            "凌波", "凌春", "凌霜", "凌雪", "莉莉", "曼蔓", "曼冬", "曼青",
            "曼容", "曼文", "曼妮", "曼云", "曼衍", "曼丽", "曼语", "曼辞", "曼珠", "曼音", "曼吟", "美丽", "美华", "米琪", "梦凡", "梦菲", "梦菡", "梦露",
            "梦琪", "梦秋", "梦竹", "妙晴", "玛丽", "茉莉", "麦冬", "安邦", "安福", "安歌", "安国", "安和", "安康", "安澜", "安民", "安宁", "安平", "安然",
            "安顺", "安翔", "安晏", "安宜", "安怡", "安易", "安志", "昂然", "昂雄", "B", "宾白", "宾鸿", "宾实", "彬彬", "彬炳", "彬郁", "斌斌", "斌蔚",
            "滨海", "波光", "波鸿", "波峻", "波涛", "博瀚", "博超", "博达", "博厚", "博简", "博明", "博容", "博赡", "博涉", "博实", "博涛", "博文", "博学",
            "博雅", "博延", "博艺", "博易", "博裕", "博远", "才捷", "才良", "才艺", "才英", "才哲", "才俊", "成和", "成弘", "成化", "成济", "成礼",
            "成龙", "成仁", "成双", "成天", "成文", "成业", "成益",
            "成荫", "成周", "承安", "承弼", "承德", "承恩", "承福", "承基", "承教", "承平", "承嗣", "承天", "承望", "承宣", "承颜", "承业", "承悦", "承允",
            "承运", "承载", "承泽", "承志", "德本", "德海", "德厚", "德华", "德辉", "德惠", "德容", "德润", "德寿", "德水", "德馨", "德曜", "德业", "德义",
            "德庸", "德佑", "德宇",
            "德元", "德运", "德泽", "德明", "固南", "颢蒙", "修湖", "渝更", "民颜", "修豪", "均亨", "笔韦", "玉轩", "游克", "帮岩", "谱吏", "润奇", "恒永",
            "瑛珐", "军飘", "良峦", "献杰", "泽杰", "绍蒙", "安东", "苏启", "腾埂", "朗瑾", "炼君", "修窍", "召淑", "才华", "叶梅", "碧雨", "媛渔", "逞秀",
            "惠璐", "鼎倚", "婷应", "纹可", "蓓曼", "紫音", "芬叶", "嫦芳", "幼有", "卿姣", "草季", "咏轩", "婷娜", "美棉", "艺近", "成览",
            "凯乐", "屏颂", "延鲜", "方妡"
    };


    private static String[] road = ("重庆大厦,黑龙江路,十梅庵街,遵义路,湘潭街,瑞金广场,仙山街,仙山东路,仙山西大厦,白沙河路,赵红广场,机场路,民航街,长城南路," +
            "流亭立交桥,虹桥广场,长城大厦,礼阳路,风岗街,中川路,白塔广场,兴阳路,文阳街,绣城路,河城大厦,锦城广场,崇阳街,华城路,康城街,正阳路,和阳广场,中城路," +
            "江城大厦,顺城路,安城街,山城广场,春城街,国城路,泰城街,德阳路,明阳大厦,春阳路,艳阳街,秋阳路,硕阳街,青威高速,瑞阳街,丰海路,双元大厦,惜福镇街道," +
            "夏庄街道,古庙工业园,中山街,太平路,广西街,潍县广场,博山大厦,湖南路,济宁街,芝罘路,易州广场,荷泽四路,荷泽二街,荷泽一路,荷泽三大厦,观海二广场," +
            "广西支街,观海一路,济宁支街,莒县路,平度广场,明水路,蒙阴大厦,青岛路,湖北街,江宁广场,郯城街,天津路,保定街,安徽路,河北大厦,黄岛路,北京街,莘县路," +
            "济南街,宁阳广场,日照街,德县路,新泰大厦,荷泽路,山西广场,沂水路,肥城街,兰山路,四方街,平原广场,泗水大厦,浙江路,曲阜街,寿康路,河南广场,泰安路,大沽街," +
            "红山峡支路,西陵峡一大厦,台西纬一广场,台西纬四街,台西纬二路,西陵峡二街,西陵峡三路,台西纬三广场,台西纬五路,明月峡大厦,青铜峡路,台西二街,观音峡广场," +
            "瞿塘峡街,团岛二路,团岛一街,台西三路,台西一大厦,郓城南路,团岛三街,刘家峡路,西藏二街,西藏一广场,台西四街,三门峡路,城武支大厦,红山峡路,郓城北广场," +
            "龙羊峡路,西陵峡街,台西五路,团岛四街,石村广场,巫峡大厦,四川路,寿张街,嘉祥路,南村广场,范县路,西康街,云南路,巨野大厦,西江广场,鱼台街,单县路,定陶街," +
            "滕县路,钜野广场,观城路,汶上大厦,朝城路,滋阳街,邹县广场,濮县街,磁山路,汶水街,西藏路,城武大厦,团岛路,南阳街,广州路,东平街,枣庄广场,贵州街,费县路," +
            "南海大厦,登州路,文登广场,信号山支路,延安一街,信号山路,兴安支街,福山支广场,红岛支大厦,莱芜二路,吴县一街,金口三路,金口一广场,伏龙山路,鱼山支街," +
            "观象二路,吴县二大厦,莱芜一广场,金口二街,海阳路,龙口街,恒山路,鱼山广场,掖县路,福山大厦,红岛路,常州街,大学广场,龙华街,齐河路,莱阳街,黄县路," +
            "张店大厦,祚山路,苏州街,华山路,伏龙街,江苏广场,龙江街,王村路,琴屿大厦,齐东路,京山广场,龙山路,牟平街,延安三路,延吉街,南京广场,东海东大厦,银川西路," +
            "海口街,山东路,绍兴广场,芝泉路,东海中街,宁夏路,香港西大厦,隆德广场,扬州街,郧阳路,太平角一街,宁国二支路,太平角二广场,天台东一路,太平角三大厦," +
            "漳州路一路,漳州街二街,宁国一支广场,太平角六街,太平角四路,天台东二街,太平角五路,宁国三大厦,澳门三路,江西支街,澳门二路,宁国四街,大尧一广场," +
            "咸阳支街,洪泽湖路,吴兴二大厦,澄海三路,天台一广场,新湛二路,三明北街,新湛支路,湛山五街,泰州三广场,湛山四大厦,闽江三路,澳门四街,南海支路,吴兴三广场," +
            "三明南路,湛山二街,二轻新村镇,江南大厦,吴兴一广场,珠海二街,嘉峪关路,高邮湖街,湛山三路,澳门六广场,泰州二路,东海一大厦,天台二路,微山湖街,洞庭湖广场," +
            "珠海支街,福州南路,澄海二街,泰州四路,香港中大厦,澳门五路,新湛三街,澳门一路,正阳关街,宁武关广场,闽江四街,新湛一路,宁国一大厦,王家麦岛,澳门七广场," +
            "泰州一路,泰州六街,大尧二路,青大一街,闽江二广场,闽江一大厦,屏东支路,湛山一街,东海西路,徐家麦岛函谷关广场,大尧三路,晓望支街,秀湛二路,逍遥三大厦,澳门九广场,泰州五街,澄海一路,澳门八街,福州北路,珠海一广场,宁国二路,临淮关大厦,燕儿岛路,紫荆关街,武胜关广场,逍遥一街,秀湛四路,居庸关街,山海关路,鄱阳湖大厦,新湛路,漳州街,仙游路,花莲街,乐清广场,巢湖街,台南路,吴兴大厦,新田路,福清广场,澄海路,莆田街,海游路,镇江街,石岛广场,宜兴大厦,三明路,仰口街,沛县路,漳浦广场,大麦岛,台湾街,天台路,金湖大厦,高雄广场,海江街,岳阳路,善化街,荣成路,澳门广场,武昌路,闽江大厦,台北路,龙岩街,咸阳广场,宁德街,龙泉路,丽水街,海川路,彰化大厦,金田路,泰州街,太湖路,江西街,泰兴广场,青大街,金门路,南通大厦,旌德路,汇泉广场,宁国路,泉州街,如东路,奉化街,鹊山广场,莲岛大厦,华严路,嘉义街,古田路,南平广场,秀湛路,长汀街,湛山路,徐州大厦,丰县广场,汕头街,新竹路,黄海街,安庆路,基隆广场,韶关路,云霄大厦,新安路,仙居街,屏东广场,晓望街,海门路,珠海街,上杭路,永嘉大厦,漳平路,盐城街,新浦路,新昌街,高田广场,市场三街,金乡东路,市场二大厦,上海支路,李村支广场,惠民南路,市场纬街,长安南路,陵县支街,冠县支广场,小港一大厦,市场一路,小港二街,清平路," +
            "广东广场,新疆路,博平街,港通路,小港沿,福建广场,高唐街,茌平路,港青街,高密路,阳谷广场,平阴路,夏津大厦,邱县路,渤海街,恩县广场,旅顺街,堂邑路,李村街,即墨路,港华大厦,港环路,馆陶街,普集路,朝阳街,甘肃广场,港夏街,港联路,陵县大厦,上海路,宝山广场,武定路,长清街,长安路,惠民街,武城广场,聊城大厦,海泊路,沧口街,宁波路,胶州广场,莱州路,招远街,冠县路,六码头,金乡广场,禹城街,临清路,东阿街,吴淞路,大港沿,辽宁路,棣纬二大厦,大港纬一路,贮水山支街,无棣纬一广场,大港纬三街,大港纬五路,大港纬四街,大港纬二路,无棣二大厦,吉林支路,大港四街,普集支路,无棣三街,黄台支广场,大港三街,无棣一路,贮水山大厦,泰山支路,大港一广场,无棣四路,大连支街,大港二路,锦州支街,德平广场,高苑大厦,长山路,乐陵街,临邑路,嫩江广场,合江路,大连街,博兴路,蒲台大厦,黄台广场,城阳街,临淄路,安邱街," +
            "临朐路,青城广场,商河路,热河大厦,济阳路,承德街,淄川广场,辽北街,阳信路,益都街,松江路,流亭大厦,吉林路,恒台街,包头路,无棣街,铁山广场,锦州街,桓台路,兴安大厦,邹平路,胶东广场,章丘路,丹东街,华阳路,青海街,泰山广场,周村大厦,四平路,台东西七街,台东东二路,台东东七广场,台东西二路,东五街,云门二路,芙蓉山村,延安二广场,云门一街,台东四路,台东一街,台东二路,杭州支广场,内蒙古路,台东七大厦,台东六路,广饶支街,台东八广场,台东三街,四平支路,郭口东街,青海支路,沈阳支大厦,菜市二路,菜市一街,北仲三路,瑞云街,滨县广场,庆祥街,万寿路,大成大厦,芙蓉路,历城广场,大名路,昌平街,平定路,长兴街,浦口广场,诸城大厦,和兴路,德盛街,宁海路,威海广场,东山路,清和街,姜沟路,雒口大厦,松山广场,长春街,昆明路,顺兴街,利津路,阳明广场,人和路,郭口大厦,营口路,昌邑街,孟庄广场,丰盛街,埕口路,丹阳街,汉口路,洮南大厦,桑梓路,沾化街,山口路,沈阳街,南口广场,振兴街,通化路,福寺大厦,峄县路,寿光广场,曹县路,昌乐街,道口路,南九水街,台湛广场,东光大厦,驼峰路,太平山,标山路,云溪广场,太清路").split(",");

    /**
     * 获取邮件号
     *
     * @param lmin
     * @param lmax
     * @return
     */
    private static String getEmail(int lmin, int lmax) {
        int length = getNum(lmin, lmax);
        StringBuffer sb = new StringBuffer();
        for (int i = 0; i < length; i++) {
            int number = (int) (Math.random() * base.length());
            sb.append(base.charAt(number));
        }
        sb.append(email_suffix[(int) (Math.random() * email_suffix.length)]);
        return sb.toString();
    }


    /**
     * 手机号前缀
     */
    private static String[] telFirst = "134,135,136,137,138,139,150,151,152,157,158,159,130,131,132,155,156,133,153".split(",");

    private static String getTel() {
        int index = getNum(0, telFirst.length - 1);
        String first = telFirst[index];
        String second = String.valueOf(getNum(1, 888) + 10000).substring(1);
        String thrid = String.valueOf(getNum(1, 9100) + 10000).substring(1);
        return first + second + thrid;
    }


    /**
     * 获取性别
     */
    private static String getSex() {
        String name_sex = "";
        int sex = getNum(0, 1);
        if (sex == 0) {
            name_sex = "女";
        } else {
            name_sex = "男";
        }
        return name_sex;
    }

    /**
     * 获取姓名
     */
    private static String getChineseName() {
        String sur = SURNAME[getNum(0, SURNAME.length - 1)];
        String name = SURADDRESS[getNum(0, SURADDRESS.length - 1)];
        return (sur + name);
    }

    /**
     * 获取地址
     */
    private static String getRoad() {
        int index = getNum(0, road.length - 1);
        String first = road[index];
        String second = String.valueOf(getNum(11, 150)) + "号";
        String third = "-" + getNum(1, 20) + "-" + getNum(1, 10);
        return first + second + third;
    }


    public static List<User> getUsers(int num) {
        List<User> u = new ArrayList<>();
        for (int i = 0; i < num; i++) {
            User user = getUser();
            u.add(user);
        }
        return u;
    }

    public static User getUser() {
        String chineseName = getChineseName();
        String road = getRoad();
        String sex = getSex();
        String tel = getTel();
        String email = getEmail(6, 9);
        String dateTime = LocalDateTime.now(ZoneOffset.of("+8")).format(formatter);//字符串转时间String dateTimeStr = "2018-07-28 14:11:15";
        User u = new User(chineseName, email, sex, road, tel, dateTime);
        //    println(u.toString());
        System.out.println(u.getName());
        return u;
    }

    public static int test() {
        int time = 0;
        int total = 1500001;
        if (total % 1500 == 0) {
            time = total / 1500;
        } else {
            time = total / 1500 + 1;
        }
        return time;
    }


    public static void main(String[] args) {
        getUser();
    }
}


